------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\User PC\Desktop\Contract Project\ABIOLA EHINFUN\Abiola_seyi f4.log
  log type:  text
 opened on:  20 Feb 2024, 18:58:50

. numlabel, a

. tab v501

                current marital status |      Freq.     Percent        Cum.
---------------------------------------+-----------------------------------
                     0. never in union |     10,669       25.51       25.51
                            1. married |     27,841       66.57       92.08
                2. living with partner |      1,047        2.50       94.59
                            3. widowed |      1,117        2.67       97.26
                           4. divorced |        543        1.30       98.56
5. no longer living together/separated |        604        1.44      100.00
---------------------------------------+-----------------------------------
                                 Total |     41,821      100.00

. drop if v501==0| v501==3 | v501==4 | v501==5
(12,933 observations deleted)

. tab v501

                current marital status |      Freq.     Percent        Cum.
---------------------------------------+-----------------------------------
                            1. married |     27,841       96.38       96.38
                2. living with partner |      1,047        3.62      100.00
---------------------------------------+-----------------------------------
                                 Total |     28,888      100.00

. tab v218

  number of |
     living |
   children |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,234        7.73        7.73
          1 |      4,219       14.60       22.34
          2 |      4,808       16.64       38.98
          3 |      4,521       15.65       54.63
          4 |      4,177       14.46       69.09
          5 |      3,373       11.68       80.77
          6 |      2,415        8.36       89.13
          7 |      1,532        5.30       94.43
          8 |        893        3.09       97.52
          9 |        419        1.45       98.97
         10 |        198        0.69       99.66
         11 |         59        0.20       99.86
         12 |         36        0.12       99.99
         13 |          2        0.01       99.99
         14 |          1        0.00      100.00
         15 |          1        0.00      100.00
------------+-----------------------------------
      Total |     28,888      100.00

. tab v137

  number of |
 children 5 |
  and under |
         in |
  household |
  (de jure) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,546       22.66       22.66
          1 |      8,673       30.02       52.68
          2 |      7,945       27.50       80.19
          3 |      3,420       11.84       92.02
          4 |      1,336        4.62       96.65
          5 |        605        2.09       98.74
          6 |        238        0.82       99.57
          7 |         91        0.32       99.88
          8 |         25        0.09       99.97
          9 |          9        0.03      100.00
------------+-----------------------------------
      Total |     28,888      100.00

. drop if v137==0
(6,546 observations deleted)

. drop if v218==0
(565 observations deleted)

. tab h32z_1

fever/cough |
  : medical |
  treatment |      Freq.     Percent        Cum.
------------+-----------------------------------
      0. no |      1,843       33.36       33.36
     1. yes |      3,681       66.64      100.00
------------+-----------------------------------
      Total |      5,524      100.00

. keep v013 v218 v190 v714 v130 v106 v501 v701 v102 v131 v206 v207 v024 v157 v158 v159 v743a v467b v743d v743b
>  v850a h21_1 h32z_1 v202 v203 v204 v205 v621 v632a v743c v743f v744d v850b

. misstable, sum all
misstable , unrecognized
    valid misstable subcommands are summarize, patterns, tree, and nested
r(198);

. summarize misstable, all
variable misstable not found
r(111);

. misstable summarize
                                                               Obs<.
                                                +------------------------------
               |                                | Unique
      Variable |     Obs=.     Obs>.     Obs<.  | values        Min         Max
  -------------+--------------------------------+------------------------------
         h21_1 |    18,871               2,906  |      2          0           1
        h32z_1 |    16,253               5,524  |      2          0           1
          v621 |        38              21,739  |      4          1           8
         v632a |     6,669              15,108  |      4          1           6
         v743c |    21,777                   0  |      0          .           .
         v743f |        48              21,729  |      5          1           7
  -----------------------------------------------------------------------------

. misstable summarize, all
                                                               Obs<.
                                                +------------------------------
               |                                | Unique
      Variable |     Obs=.     Obs>.     Obs<.  | values        Min         Max
  -------------+--------------------------------+------------------------------
          v013 |                        21,777  |      7          1           7
          v024 |                        21,777  |      6          1           6
          v102 |                        21,777  |      2          1           2
          v106 |                        21,777  |      4          0           3
          v130 |                        21,777  |      5          1          96
          v131 |                        21,777  |     12          1          98
          v157 |                        21,777  |      3          0           2
          v158 |                        21,777  |      3          0           2
          v159 |                        21,777  |      3          0           2
          v190 |                        21,777  |      5          1           5
          v202 |                        21,777  |     11          0          10
          v203 |                        21,777  |      8          0           7
          v204 |                        21,777  |      7          0           6
          v205 |                        21,777  |      8          0           7
          v206 |                        21,777  |      8          0           7
          v207 |                        21,777  |      7          0           6
          v218 |                        21,777  |     13          1          13
         v467b |                        21,777  |      2          1           2
         h21_1 |    18,871               2,906  |      2          0           1
        h32z_1 |    16,253               5,524  |      2          0           1
          v501 |                        21,777  |      2          1           2
          v621 |        38              21,739  |      4          1           8
         v632a |     6,669              15,108  |      4          1           6
          v701 |                        21,777  |      5          0           8
          v714 |                        21,777  |      2          0           1
         v743a |                        21,777  |      5          1           6
         v743b |                        21,777  |      5          1           6
         v743c |    21,777                   0  |      0          .           .
         v743d |                        21,777  |      5          1           6
         v743f |        48              21,729  |      5          1           7
         v744d |                        21,777  |      3          0           8
         v850a |                        21,777  |      3          0           8
         v850b |                        21,777  |      3          0           8
  -----------------------------------------------------------------------------

. tab v137
variable v137 not found
r(111);

. clear

. use "C:\Users\User PC\Desktop\NDHS Data\NGIR7AFL.DTA"

. numlabel, a

. tab v501

                current marital status |      Freq.     Percent        Cum.
---------------------------------------+-----------------------------------
                     0. never in union |     10,669       25.51       25.51
                            1. married |     27,841       66.57       92.08
                2. living with partner |      1,047        2.50       94.59
                            3. widowed |      1,117        2.67       97.26
                           4. divorced |        543        1.30       98.56
5. no longer living together/separated |        604        1.44      100.00
---------------------------------------+-----------------------------------
                                 Total |     41,821      100.00

. drop if v501==0| v501==3 | v501==4 | v501==5
(12,933 observations deleted)

. tab v501

                current marital status |      Freq.     Percent        Cum.
---------------------------------------+-----------------------------------
                            1. married |     27,841       96.38       96.38
                2. living with partner |      1,047        3.62      100.00
---------------------------------------+-----------------------------------
                                 Total |     28,888      100.00

. tab v218

  number of |
     living |
   children |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,234        7.73        7.73
          1 |      4,219       14.60       22.34
          2 |      4,808       16.64       38.98
          3 |      4,521       15.65       54.63
          4 |      4,177       14.46       69.09
          5 |      3,373       11.68       80.77
          6 |      2,415        8.36       89.13
          7 |      1,532        5.30       94.43
          8 |        893        3.09       97.52
          9 |        419        1.45       98.97
         10 |        198        0.69       99.66
         11 |         59        0.20       99.86
         12 |         36        0.12       99.99
         13 |          2        0.01       99.99
         14 |          1        0.00      100.00
         15 |          1        0.00      100.00
------------+-----------------------------------
      Total |     28,888      100.00

. tab v137

  number of |
 children 5 |
  and under |
         in |
  household |
  (de jure) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,546       22.66       22.66
          1 |      8,673       30.02       52.68
          2 |      7,945       27.50       80.19
          3 |      3,420       11.84       92.02
          4 |      1,336        4.62       96.65
          5 |        605        2.09       98.74
          6 |        238        0.82       99.57
          7 |         91        0.32       99.88
          8 |         25        0.09       99.97
          9 |          9        0.03      100.00
------------+-----------------------------------
      Total |     28,888      100.00

. drop if v137==0
(6,546 observations deleted)

. drop if v218==0
(565 observations deleted)

. tab h32z_1

fever/cough |
  : medical |
  treatment |      Freq.     Percent        Cum.
------------+-----------------------------------
      0. no |      1,843       33.36       33.36
     1. yes |      3,681       66.64      100.00
------------+-----------------------------------
      Total |      5,524      100.00

. keep v013 v218 v190 v714 v130 v106 v501 v701 v102 v131 v206 v207 v024 v157 v158 v159 v743a v467b v743d v743b
>  v850a h21_1 h32z_1 v202 v203 v204 v205 v621 v632a v743c v743f v744d v850b v137

. tab v137

  number of |
 children 5 |
  and under |
         in |
  household |
  (de jure) |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      8,422       38.67       38.67
          2 |      7,755       35.61       74.28
          3 |      3,336       15.32       89.60
          4 |      1,311        6.02       95.62
          5 |        598        2.75       98.37
          6 |        231        1.06       99.43
          7 |         90        0.41       99.84
          8 |         25        0.11       99.96
          9 |          9        0.04      100.00
------------+-----------------------------------
      Total |     21,777      100.00

. tab v850b

 respondent can ask partner to |
                  use a condom |      Freq.     Percent        Cum.
-------------------------------+-----------------------------------
                         0. no |     11,998       55.09       55.09
                        1. yes |      8,943       41.07       96.16
8. don't know/not sure/depends |        836        3.84      100.00
-------------------------------+-----------------------------------
                         Total |     21,777      100.00

. gen no_treatment = 0 if h21_1 == 1 | h32z_1== 1
(16,680 missing values generated)

. replace no_treatmen = 1 if h21_1 == 0 | h32z_1 == 0
(2,158 real changes made)

. label define no_treatment 0 "no" 1 "yes"

. label value no_treatment no_treatment

. numlabel, a

. tab no_treatment

no_treatmen |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
      0. no |      4,575       67.95       67.95
     1. yes |      2,158       32.05      100.00
------------+-----------------------------------
      Total |      6,733      100.00

. misstable summarize, all
                                                               Obs<.
                                                +------------------------------
               |                                | Unique
      Variable |     Obs=.     Obs>.     Obs<.  | values        Min         Max
  -------------+--------------------------------+------------------------------
          v013 |                        21,777  |      7          1           7
          v024 |                        21,777  |      6          1           6
          v102 |                        21,777  |      2          1           2
          v106 |                        21,777  |      4          0           3
          v130 |                        21,777  |      5          1          96
          v131 |                        21,777  |     12          1          98
          v137 |                        21,777  |      9          1           9
          v157 |                        21,777  |      3          0           2
          v158 |                        21,777  |      3          0           2
          v159 |                        21,777  |      3          0           2
          v190 |                        21,777  |      5          1           5
          v202 |                        21,777  |     11          0          10
          v203 |                        21,777  |      8          0           7
          v204 |                        21,777  |      7          0           6
          v205 |                        21,777  |      8          0           7
          v206 |                        21,777  |      8          0           7
          v207 |                        21,777  |      7          0           6
          v218 |                        21,777  |     13          1          13
         v467b |                        21,777  |      2          1           2
         h21_1 |    18,871               2,906  |      2          0           1
        h32z_1 |    16,253               5,524  |      2          0           1
          v501 |                        21,777  |      2          1           2
          v621 |        38              21,739  |      4          1           8
         v632a |     6,669              15,108  |      4          1           6
          v701 |                        21,777  |      5          0           8
          v714 |                        21,777  |      2          0           1
         v743a |                        21,777  |      5          1           6
         v743b |                        21,777  |      5          1           6
         v743c |    21,777                   0  |      0          .           .
         v743d |                        21,777  |      5          1           6
         v743f |        48              21,729  |      5          1           7
         v744d |                        21,777  |      3          0           8
         v850a |                        21,777  |      3          0           8
         v850b |                        21,777  |      3          0           8
  no_treatment |    15,044               6,733  |      2          0           1
  -----------------------------------------------------------------------------

. drop if h21_1==. & h32z_1==.
(15,044 observations deleted)

. misstable summarize, all
                                                               Obs<.
                                                +------------------------------
               |                                | Unique
      Variable |     Obs=.     Obs>.     Obs<.  | values        Min         Max
  -------------+--------------------------------+------------------------------
          v013 |                         6,733  |      7          1           7
          v024 |                         6,733  |      6          1           6
          v102 |                         6,733  |      2          1           2
          v106 |                         6,733  |      4          0           3
          v130 |                         6,733  |      5          1          96
          v131 |                         6,733  |     12          1          98
          v137 |                         6,733  |      9          1           9
          v157 |                         6,733  |      3          0           2
          v158 |                         6,733  |      3          0           2
          v159 |                         6,733  |      3          0           2
          v190 |                         6,733  |      5          1           5
          v202 |                         6,733  |     10          0           9
          v203 |                         6,733  |      8          0           7
          v204 |                         6,733  |      7          0           6
          v205 |                         6,733  |      7          0           7
          v206 |                         6,733  |      7          0           6
          v207 |                         6,733  |      7          0           6
          v218 |                         6,733  |     12          1          12
         v467b |                         6,733  |      2          1           2
         h21_1 |     3,827               2,906  |      2          0           1
        h32z_1 |     1,209               5,524  |      2          0           1
          v501 |                         6,733  |      2          1           2
          v621 |         7               6,726  |      4          1           8
         v632a |     2,124               4,609  |      4          1           6
          v701 |                         6,733  |      5          0           8
          v714 |                         6,733  |      2          0           1
         v743a |                         6,733  |      5          1           6
         v743b |                         6,733  |      5          1           6
         v743c |     6,733                   0  |      0          .           .
         v743d |                         6,733  |      5          1           6
         v743f |        13               6,720  |      5          1           7
         v744d |                         6,733  |      3          0           8
         v850a |                         6,733  |      3          0           8
         v850b |                         6,733  |      3          0           8
  no_treatment |                         6,733  |      2          0           1
  -----------------------------------------------------------------------------

. tab v632a

    decision maker for not |
       using contraception |      Freq.     Percent        Cum.
---------------------------+-----------------------------------
      1. mainly respondent |      1,837       39.86       39.86
2. mainly husband, partner |        991       21.50       61.36
         3. joint decision |      1,734       37.62       98.98
                  6. other |         47        1.02      100.00
---------------------------+-----------------------------------
                     Total |      4,609      100.00

. tab v743c
no observations

. tab v743f

person who usually decides what to |
       do with money husband earns |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
               1. respondent alone |        412        6.13        6.13
 2. respondent and husband/partner |      1,193       17.75       23.88
          4. husband/partner alone |      5,084       75.65       99.54
                          6. other |         16        0.24       99.78
7. husband/partner has no earnings |         15        0.22      100.00
-----------------------------------+-----------------------------------
                             Total |      6,720      100.00

. drop v743c

. misstable summarize, all
                                                               Obs<.
                                                +------------------------------
               |                                | Unique
      Variable |     Obs=.     Obs>.     Obs<.  | values        Min         Max
  -------------+--------------------------------+------------------------------
          v013 |                         6,733  |      7          1           7
          v024 |                         6,733  |      6          1           6
          v102 |                         6,733  |      2          1           2
          v106 |                         6,733  |      4          0           3
          v130 |                         6,733  |      5          1          96
          v131 |                         6,733  |     12          1          98
          v137 |                         6,733  |      9          1           9
          v157 |                         6,733  |      3          0           2
          v158 |                         6,733  |      3          0           2
          v159 |                         6,733  |      3          0           2
          v190 |                         6,733  |      5          1           5
          v202 |                         6,733  |     10          0           9
          v203 |                         6,733  |      8          0           7
          v204 |                         6,733  |      7          0           6
          v205 |                         6,733  |      7          0           7
          v206 |                         6,733  |      7          0           6
          v207 |                         6,733  |      7          0           6
          v218 |                         6,733  |     12          1          12
         v467b |                         6,733  |      2          1           2
         h21_1 |     3,827               2,906  |      2          0           1
        h32z_1 |     1,209               5,524  |      2          0           1
          v501 |                         6,733  |      2          1           2
          v621 |         7               6,726  |      4          1           8
         v632a |     2,124               4,609  |      4          1           6
          v701 |                         6,733  |      5          0           8
          v714 |                         6,733  |      2          0           1
         v743a |                         6,733  |      5          1           6
         v743b |                         6,733  |      5          1           6
         v743d |                         6,733  |      5          1           6
         v743f |        13               6,720  |      5          1           7
         v744d |                         6,733  |      3          0           8
         v850a |                         6,733  |      3          0           8
         v850b |                         6,733  |      3          0           8
  no_treatment |                         6,733  |      2          0           1
  -----------------------------------------------------------------------------

. tab v632a

    decision maker for not |
       using contraception |      Freq.     Percent        Cum.
---------------------------+-----------------------------------
      1. mainly respondent |      1,837       39.86       39.86
2. mainly husband, partner |        991       21.50       61.36
         3. joint decision |      1,734       37.62       98.98
                  6. other |         47        1.02      100.00
---------------------------+-----------------------------------
                     Total |      4,609      100.00

. tab v743f

person who usually decides what to |
       do with money husband earns |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
               1. respondent alone |        412        6.13        6.13
 2. respondent and husband/partner |      1,193       17.75       23.88
          4. husband/partner alone |      5,084       75.65       99.54
                          6. other |         16        0.24       99.78
7. husband/partner has no earnings |         15        0.22      100.00
-----------------------------------+-----------------------------------
                             Total |      6,720      100.00

. misstable summarize, all
                                                               Obs<.
                                                +------------------------------
               |                                | Unique
      Variable |     Obs=.     Obs>.     Obs<.  | values        Min         Max
  -------------+--------------------------------+------------------------------
          v013 |                         6,733  |      7          1           7
          v024 |                         6,733  |      6          1           6
          v102 |                         6,733  |      2          1           2
          v106 |                         6,733  |      4          0           3
          v130 |                         6,733  |      5          1          96
          v131 |                         6,733  |     12          1          98
          v137 |                         6,733  |      9          1           9
          v157 |                         6,733  |      3          0           2
          v158 |                         6,733  |      3          0           2
          v159 |                         6,733  |      3          0           2
          v190 |                         6,733  |      5          1           5
          v202 |                         6,733  |     10          0           9
          v203 |                         6,733  |      8          0           7
          v204 |                         6,733  |      7          0           6
          v205 |                         6,733  |      7          0           7
          v206 |                         6,733  |      7          0           6
          v207 |                         6,733  |      7          0           6
          v218 |                         6,733  |     12          1          12
         v467b |                         6,733  |      2          1           2
         h21_1 |     3,827               2,906  |      2          0           1
        h32z_1 |     1,209               5,524  |      2          0           1
          v501 |                         6,733  |      2          1           2
          v621 |         7               6,726  |      4          1           8
         v632a |     2,124               4,609  |      4          1           6
          v701 |                         6,733  |      5          0           8
          v714 |                         6,733  |      2          0           1
         v743a |                         6,733  |      5          1           6
         v743b |                         6,733  |      5          1           6
         v743d |                         6,733  |      5          1           6
         v743f |        13               6,720  |      5          1           7
         v744d |                         6,733  |      3          0           8
         v850a |                         6,733  |      3          0           8
         v850b |                         6,733  |      3          0           8
  no_treatment |                         6,733  |      2          0           1
  -----------------------------------------------------------------------------

. clear

. use "C:\Users\User PC\Desktop\NDHS Data\NGIR7AFL.DTA"

. numlabel, a

. tab v501

                current marital status |      Freq.     Percent        Cum.
---------------------------------------+-----------------------------------
                     0. never in union |     10,669       25.51       25.51
                            1. married |     27,841       66.57       92.08
                2. living with partner |      1,047        2.50       94.59
                            3. widowed |      1,117        2.67       97.26
                           4. divorced |        543        1.30       98.56
5. no longer living together/separated |        604        1.44      100.00
---------------------------------------+-----------------------------------
                                 Total |     41,821      100.00

. drop if v501==0| v501==3 | v501==4 | v501==5
(12,933 observations deleted)

. tab v501

                current marital status |      Freq.     Percent        Cum.
---------------------------------------+-----------------------------------
                            1. married |     27,841       96.38       96.38
                2. living with partner |      1,047        3.62      100.00
---------------------------------------+-----------------------------------
                                 Total |     28,888      100.00

. tab v218

  number of |
     living |
   children |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,234        7.73        7.73
          1 |      4,219       14.60       22.34
          2 |      4,808       16.64       38.98
          3 |      4,521       15.65       54.63
          4 |      4,177       14.46       69.09
          5 |      3,373       11.68       80.77
          6 |      2,415        8.36       89.13
          7 |      1,532        5.30       94.43
          8 |        893        3.09       97.52
          9 |        419        1.45       98.97
         10 |        198        0.69       99.66
         11 |         59        0.20       99.86
         12 |         36        0.12       99.99
         13 |          2        0.01       99.99
         14 |          1        0.00      100.00
         15 |          1        0.00      100.00
------------+-----------------------------------
      Total |     28,888      100.00

. tab v137

  number of |
 children 5 |
  and under |
         in |
  household |
  (de jure) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,546       22.66       22.66
          1 |      8,673       30.02       52.68
          2 |      7,945       27.50       80.19
          3 |      3,420       11.84       92.02
          4 |      1,336        4.62       96.65
          5 |        605        2.09       98.74
          6 |        238        0.82       99.57
          7 |         91        0.32       99.88
          8 |         25        0.09       99.97
          9 |          9        0.03      100.00
------------+-----------------------------------
      Total |     28,888      100.00

. drop if v137==0
(6,546 observations deleted)

. drop if v218==0
(565 observations deleted)

. tab h32z_1

fever/cough |
  : medical |
  treatment |      Freq.     Percent        Cum.
------------+-----------------------------------
      0. no |      1,843       33.36       33.36
     1. yes |      3,681       66.64      100.00
------------+-----------------------------------
      Total |      5,524      100.00

. keep v013 v218 v190 v714 v130 v106 v501 v701 v102 v131 v206 v207 v024 v157 v158 v159 v743a v467b v74
> 3d v743b v850a h21_1 h32z_1 v202 v203 v204 v205 v621 v739 v743f v744d v850b v137

. tab v739

person who usually decides how to |
      spend respondent's earnings |      Freq.     Percent        Cum.
----------------------------------+-----------------------------------
              1. respondent alone |      9,231       70.58       70.58
2. respondent and husband/partner |      2,626       20.08       90.66
         4. husband/partner alone |      1,219        9.32       99.98
                  5. someone else |          3        0.02      100.00
----------------------------------+-----------------------------------
                            Total |     13,079      100.00

. tab v137

  number of |
 children 5 |
  and under |
         in |
  household |
  (de jure) |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      8,422       38.67       38.67
          2 |      7,755       35.61       74.28
          3 |      3,336       15.32       89.60
          4 |      1,311        6.02       95.62
          5 |        598        2.75       98.37
          6 |        231        1.06       99.43
          7 |         90        0.41       99.84
          8 |         25        0.11       99.96
          9 |          9        0.04      100.00
------------+-----------------------------------
      Total |     21,777      100.00

. tab v850b

 respondent can ask partner to |
                  use a condom |      Freq.     Percent        Cum.
-------------------------------+-----------------------------------
                         0. no |     11,998       55.09       55.09
                        1. yes |      8,943       41.07       96.16
8. don't know/not sure/depends |        836        3.84      100.00
-------------------------------+-----------------------------------
                         Total |     21,777      100.00

. gen no_treatment = 0 if h21_1 == 1 | h32z_1== 1
(16,680 missing values generated)

. replace no_treatmen = 1 if h21_1 == 0 | h32z_1 == 0
(2,158 real changes made)

. label define no_treatment 0 "no" 1 "yes"

. label value no_treatment no_treatment

. numlabel, a

. tab no_treatment

no_treatmen |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
      0. no |      4,575       67.95       67.95
     1. yes |      2,158       32.05      100.00
------------+-----------------------------------
      Total |      6,733      100.00

. misstable summarize, all
                                                               Obs<.
                                                +------------------------------
               |                                | Unique
      Variable |     Obs=.     Obs>.     Obs<.  | values        Min         Max
  -------------+--------------------------------+------------------------------
          v013 |                        21,777  |      7          1           7
          v024 |                        21,777  |      6          1           6
          v102 |                        21,777  |      2          1           2
          v106 |                        21,777  |      4          0           3
          v130 |                        21,777  |      5          1          96
          v131 |                        21,777  |     12          1          98
          v137 |                        21,777  |      9          1           9
          v157 |                        21,777  |      3          0           2
          v158 |                        21,777  |      3          0           2
          v159 |                        21,777  |      3          0           2
          v190 |                        21,777  |      5          1           5
          v202 |                        21,777  |     11          0          10
          v203 |                        21,777  |      8          0           7
          v204 |                        21,777  |      7          0           6
          v205 |                        21,777  |      8          0           7
          v206 |                        21,777  |      8          0           7
          v207 |                        21,777  |      7          0           6
          v218 |                        21,777  |     13          1          13
         v467b |                        21,777  |      2          1           2
         h21_1 |    18,871               2,906  |      2          0           1
        h32z_1 |    16,253               5,524  |      2          0           1
          v501 |                        21,777  |      2          1           2
          v621 |        38              21,739  |      4          1           8
          v701 |                        21,777  |      5          0           8
          v714 |                        21,777  |      2          0           1
          v739 |     8,698              13,079  |      4          1           5
         v743a |                        21,777  |      5          1           6
         v743b |                        21,777  |      5          1           6
         v743d |                        21,777  |      5          1           6
         v743f |        48              21,729  |      5          1           7
         v744d |                        21,777  |      3          0           8
         v850a |                        21,777  |      3          0           8
         v850b |                        21,777  |      3          0           8
  no_treatment |    15,044               6,733  |      2          0           1
  -----------------------------------------------------------------------------

. drop if h21_1==. & h32z_1==.
(15,044 observations deleted)

. misstable summarize, all
                                                               Obs<.
                                                +------------------------------
               |                                | Unique
      Variable |     Obs=.     Obs>.     Obs<.  | values        Min         Max
  -------------+--------------------------------+------------------------------
          v013 |                         6,733  |      7          1           7
          v024 |                         6,733  |      6          1           6
          v102 |                         6,733  |      2          1           2
          v106 |                         6,733  |      4          0           3
          v130 |                         6,733  |      5          1          96
          v131 |                         6,733  |     12          1          98
          v137 |                         6,733  |      9          1           9
          v157 |                         6,733  |      3          0           2
          v158 |                         6,733  |      3          0           2
          v159 |                         6,733  |      3          0           2
          v190 |                         6,733  |      5          1           5
          v202 |                         6,733  |     10          0           9
          v203 |                         6,733  |      8          0           7
          v204 |                         6,733  |      7          0           6
          v205 |                         6,733  |      7          0           7
          v206 |                         6,733  |      7          0           6
          v207 |                         6,733  |      7          0           6
          v218 |                         6,733  |     12          1          12
         v467b |                         6,733  |      2          1           2
         h21_1 |     3,827               2,906  |      2          0           1
        h32z_1 |     1,209               5,524  |      2          0           1
          v501 |                         6,733  |      2          1           2
          v621 |         7               6,726  |      4          1           8
          v701 |                         6,733  |      5          0           8
          v714 |                         6,733  |      2          0           1
          v739 |     2,748               3,985  |      3          1           4
         v743a |                         6,733  |      5          1           6
         v743b |                         6,733  |      5          1           6
         v743d |                         6,733  |      5          1           6
         v743f |        13               6,720  |      5          1           7
         v744d |                         6,733  |      3          0           8
         v850a |                         6,733  |      3          0           8
         v850b |                         6,733  |      3          0           8
  no_treatment |                         6,733  |      2          0           1
  -----------------------------------------------------------------------------

. tab v739

person who usually decides how to |
      spend respondent's earnings |      Freq.     Percent        Cum.
----------------------------------+-----------------------------------
              1. respondent alone |      2,902       72.82       72.82
2. respondent and husband/partner |        682       17.11       89.94
         4. husband/partner alone |        401       10.06      100.00
----------------------------------+-----------------------------------
                            Total |      3,985      100.00

. tab v501

                current marital status |      Freq.     Percent        Cum.
---------------------------------------+-----------------------------------
                            1. married |      6,545       97.21       97.21
                2. living with partner |        188        2.79      100.00
---------------------------------------+-----------------------------------
                                 Total |      6,733      100.00

. browse

